Pandas

In [3]:
#importing pandas library
import pandas as pd
import numpy as np

Create a DataFrame

In [5]:
# dataframe creation
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [7]:
np.arange(1,21).reshape(5,4)

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20]])

In [8]:
pd.DataFrame(data=np.arange(1,21).reshape(5,4),
             index=["row1","row2","row3","row4","row5"],
             columns=["col1","col2","col3","col4"])

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

In [9]:
df=pd.DataFrame(data=np.arange(1,21).reshape(5,4),
                index=["row1","row2","row3","row4","row5"],
                columns=["col1","col2","col3","col4"])

In [10]:
df

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

In [11]:
df.head()

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

In [12]:
df.tail()

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, row1 to row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int64
 1   col2    5 non-null      int64
 2   col3    5 non-null      int64
 3   col4    5 non-null      int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [16]:
df

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

In [15]:
df.describe()

            col1       col2       col3       col4
count   5.000000   5.000000   5.000000   5.000000
mean    9.000000  10.000000  11.000000  12.000000
std     6.324555   6.324555   6.324555   6.324555
min     1.000000   2.000000   3.000000   4.000000
25%     5.000000   6.000000   7.000000   8.000000
50%     9.000000  10.000000  11.000000  12.000000
75%    13.000000  14.000000  15.000000  16.000000
max    17.000000  18.000000  19.000000  20.000000

##Indexing

columnname, rowindex[loc],rowindex columnindex number[.iloc]

In [17]:
df.head()

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

indexing using columnname

In [18]:
df[['col1','col2','col3']]

      col1  col2  col3
row1     1     2     3
row2     5     6     7
row3     9    10    11
row4    13    14    15
row5    17    18    19

In [20]:
df[['col1']]

      col1
row1     1
row2     5
row3     9
row4    13
row5    17

In [21]:
df['col1']

row1     1
row2     5
row3     9
row4    13
row5    17
Name: col1, dtype: int64

In [23]:
type(df[['col1','col2','col3']])

pandas.core.frame.DataFrame

In [25]:
type(df['col1'])

pandas.core.series.Series

rowindex[loc]

In [27]:
df.loc['row3']

col1     9
col2    10
col3    11
col4    12
Name: row3, dtype: int64

In [28]:
type(df.loc['row3'])

pandas.core.series.Series